# Напишите программу для печати всех уникальных значений в словаре. 

dict_1 = {"V": "S001","V": "S002","VI": "S001","VI": "S005","VII": " S005 "," V ":" S009 "," VIII":" S007 "}
unique_values = len(set(dict_1.values()))
print('Уникальные значения в заданном словаре: ', unique_values)